[{"name":"Creamy Tomato Chicken","ingredients":["1 lb Chicken Breast","1 jar Tomato Sauce","1 cup Yoghurt","1/2 cup grated Parmesan cheese","1 tsp dried oregano","salt and pepper to taste","olive oil."],"instructions":"1. Season chicken breast with salt, pepper, and oregano. 2. Sear chicken in olive oil until browned on both sides. 3. Add tomato sauce and simmer until chicken is cooked through (about 15-20 minutes). 4. Stir in yoghurt and parmesan cheese.  5. Heat through gently, do not boil. Serve over pasta or rice.","expiringSoon":true},{"name":"Tuna Lettuce Wraps","ingredients":["Fresh Tuna","Lettuce leaves","Fresh red pepper (finely diced)","1 tbsp mayonnaise"," 1 tbsp lemon juice","salt and pepper to taste."],"instructions":"1. Gently mix tuna with mayonnaise, lemon juice, salt, and pepper. 2.  Dice red pepper finely.  3. Add diced red pepper to the tuna mixture. 4. Spoon tuna mixture into lettuce leaves and serve.","expiringSoon":false},{"name":"Black Eyed Pea Salad","ingredients":["1 can Black Eyed Peas (drained and rinsed)","1/2 cup chopped red onion","1/4 cup chopped fresh cilantro","2 tbsp lime juice","1 tbsp olive oil","salt and pepper to taste."],"instructions":"1. Combine black eyed peas, red onion, and cilantro in a bowl. 2. Whisk together lime juice, olive oil, salt, and pepper. 3. Pour dressing over the black eyed pea mixture and toss to combine.  4. Refrigerate for at least 30 minutes before serving.","expiringSoon":false},{"name":"Chicken and Black Eyed Pea Stew","ingredients":["1 lb Chicken Breast (cubed)","1 can Black Eyed Peas (drained and rinsed)","1 large onion (chopped)","2 carrots (chopped)","2 celery stalks (chopped)","4 cups chicken broth","1 tsp dried thyme","salt and pepper to taste."],"instructions":"1. In a large pot or Dutch oven, sauté onion, carrots, and celery in olive oil until softened. 2. Add cubed chicken and cook until browned. 3. Stir in chicken broth, black eyed peas, and thyme. 4. Bring to a boil, then reduce heat and simmer for 20-25 minutes, or until chicken is cooked through. 5. Season with salt and pepper to taste.  Serve with crusty bread.","expiringSoon":true}]